Repository: sheilagomes/wp-trad
Catalog: tm/WP_blog_1.tmx
Source language: en
Languages: pt_br

source: WordPress 4.9 Beta 1 is now available!
pt_br: O WordPress 4.9 Beta 1 já está disponível!

source: This software is still in development, so we don’t recommend you run it on a production site.
pt_br: Esta versão ainda está em desenvolvimento, portanto não recomendamos seu uso em ambientes de produção.

source: Consider setting up a test site just to play with the new version.
pt_br: Considere criar um site de teste só para brincar com a nova versão.

source: To test WordPress 4.9, try the WordPress Beta Tester plugin (you’ll want “bleeding edge nightlies”). Or you can download the beta here (zip).
pt_br: Para testar o WordPress 4.9 tente o plugin WordPress Beta Tester ou faça o download da versão beta aqui (arquivo zip).

source: WordPress 4.9 is slated for release on November 14, but we need your help to get there.
pt_br: O lançamento do WordPress 4.9 está programado para o dia 14 de novembro, mas precisamos da sua ajuda para que isso aconteça.

source: We’ve been working on making it even easier to customize your site.
pt_br: Estivemos trabalhando para que seja ainda mais fácil personalizar o seu site.

source: Here are some of the bigger items to test and help us find as many bugs as possible in the coming weeks:
pt_br: Aqui estão alguns dos itens mais importantes a testar e nos ajudar, nas próximas semanas, a encontrar tantos erros quanto for possível:

source: Drafting and scheduling of changes in the Customizer.
pt_br: Rascunhar e agendar mudanças no Personalizar.

source: Once you save or schedule a changeset, when any user comes into the Customizer the pending changes will be autoloaded.
pt_br: Uma vez que você salve ou agende um grupo de mudanças, quando qualquer usuário acessar o Personalizar as mudanças serão carregadas automaticamente.

source: A button is provided to discard changes to restore the Customizer to the last published state.
pt_br: Um botão descarta as mudanças para voltar os itens do Personalizar aos últimos valores publicados.

source: This is a new “linear” mode for changesets, as opposed to “branching” mode which can be enabled by filter so that every time user opens the Customizer a new blank changeset will be started.
pt_br: Este é um novo modo linear para os conjuntos de mudanças, oposto ao modelo de ramificação que pode ser habilitado através de um filtro, dessa forma toda vez que um usuário abrir o Personalizar um grupo novo de mudanças será iniciado.

source: Addition of a frontend preview link to the Customizer to allow changes to be browsed on the frontend, even without a user being logged in.
pt_br: Criação no Personalizar de um link para pré-visualização que permite navegar pelo site modificado mesmo que o usuário não esteja conectado.

source: Addition of autosave revisions in the Customizer.
pt_br: Criação de revisões por salvamento automático no Personalizar.

source: A brand new theme browsing experience in the Customizer.
pt_br: Uma experiência de navegação pelos temas completamente nova no Personalizar.

source: Gallery widget, following the media and image widgets introduced in 4.8.
pt_br: Um widget de galeria, seguindo o caminho iniciado pelos widgets de mídia e imagem que foram lançados na versão 4.8.

source: Support for shortcodes in Text widgets.
pt_br: Suporte a shortcodes nos widgets de texto.

source: Support for adding media to Text widgets.
pt_br: Suporte para adição de mídia nos widgets de texto.

source: Support for adding oEmbeds outside post content, including Text widgets.
pt_br: Suporte para adição de oEmbeds (elementos incorporados automaticamente, como vídeos do YouTube e etc.) fora do conteúdo do post, incluindo widgets de texto.

source: Support for videos from providers other than YouTube and Vimeo in the Video widget.
pt_br: Suporte para vídeos publicados em outros sites além do YouTube e Vimeo no widget de vídeo.

source: Improve the flow for creating new menus in the Customizer.
pt_br: Melhoria no fluxo para criação de novos menus no Personalizar.

source: Educated guess mapping of nav menus and widgets when switching themes.
pt_br: Mapeamento entre as localizações dos menus e áreas de widgets ao trocar de tema.

source: Plugins: Introduce singular capabilities for activating and deactivating individual plugins.
pt_br: Plugins: introdução de capacidades para ativar e desativar plugins individualmente.

source: Sandbox PHP file edits in both plugins and themes, without auto-deactivation when an error occurs.
pt_br: Teste de edição de arquivos PHP em plugins e temas, sem desativação automática ao ocorrer um erro.

source: A PHP edit that introduces a fatal error is rolled back with an opportunity then for the user to fix the error and attempt to re-save.
pt_br: Uma edição em um arquivo PHP que produz um erro fatal é desfeita e o usuário tem a oportunidade de consertá-lo e, então, salvá-lo novamente.

source: Addition of dirty state for widgets on the admin screen, indicating when a widget has been successfully saved and showing an “Are you sure?” dialog when attempting to leave without saving changes.
pt_br: Criação de um estado “não salvo” na tela de administração, indicando quando um widget foi salvo e exibindo um alerta “Você tem certeza?” ao tentar deixar a tela sem salvar as alterações.

source: As always, there have been exciting changes for developers to explore as well, such as: CodeMirror editor added to theme/plugin editor, Custom CSS in Customizer, and Custom HTML widgets.
pt_br: Como sempre, também temos mudanças emocionantes para os desenvolvedores explorarem, tais como: Adição do editor CodeMirror para editar temas e plugins, CSS adicional no Personalizar e os widgets de HTML personalizado.

source: Integration includes support for linters to catch errors before you attempt to save.
pt_br: A integração inclui suporte para analisadores automáticos de código (linters) para evitar erros antes de salvar.

source: Includes new APIs for plugins to instantiate editors.
pt_br: Inclui novas APIs para plugins instanciarem editores.

source: Introduction of an extensible code editor control for adding instances of CodeMirror to the Customizer.
pt_br: Introdução de um controle extensível do editor de código para adicionar instâncias do CodeMirror ao Personalizar.

source: Addition of global notifications area, panel and section notifications, and a notification overlay that takes over the entire screen in the Customizer.
pt_br: Adição de uma área global de notificações, notificações de painel e de seção e notificações que se sobrepõem à tela inteira no Personalizar.

source: A date/time control in the Customizer.
pt_br: Um controle para data e horário no Personalizar.

source: Improve usability of Customize JS API.
pt_br: Melhoria de usabilidade na API JS do Personalizar.

source: Introduction of control templates for base controls.
pt_br: Criação de modelos para controles básicos.

source: Use WP_Term_Query when transforming tax queries.
pt_br: Uso de WP_Term_Query na transformação de consultas por taxonomia.

source: Database: Add support for MySQL servers connecting to IPv6 hosts.
pt_br: Banco de dados: adição de suporte para conexão através de IPv6 por servidores MySQL.

source: Emoji: Bring Twemoji compatibility to PHP.
pt_br: Emoji: porte do Twemoji para o PHP.

source: Test for any weirdness with emoji in RSS feeds or emails.
pt_br: Procure por qualquer esquisitice com os emoji nos feeds RSS ou e-mails.

source: I18N: Introduce the Plural_Forms class.
pt_br: Internacionalização: introdução da classe Plural_Forms.

source: Media: Upgrade MediaElement.js to 4.2.5-74e01a40.
pt_br: Mídia: atualização do arquivo MediaElement.js para a versão 4.2.5-74e01a40.

source: Media: Use max-width for default captions.
pt_br: Mídia: uso de max-width para a legenda padrão.

source: We will want to make sure this doesn’t cause unexpected visual regressions in existing themes, default themes were all fine in testing.
pt_br: Queremos ter certeza de que isso não causa nenhum problema no visual dos temas que já existem, os temas padrão foram bem nos testes.

source: Media: Reduce duplicated custom header crops in the Customizer.
pt_br: Mídia: redução de corte duplicado em cabeçalhos personalizados no Personalizar.

source: Media: Store video creation date in meta.
pt_br: Mídia: gravação da data de criação dos vídeos nos metadados.

source: Please help test different kinds of videos.
pt_br: Ajude a testar diferentes tipos de vídeos.

source: Multisite: Introduce get_site_by().
pt_br: Multisite: introdução de get_site_by().

source: Multisite: Improve get_blog_details() by using get_site_by().
pt_br: Multisite: melhoria em get_blog_details() fazendo-a usar get_site_by().

source: Multisite: Improve initializing available roles when switch sites.
pt_br: Multisite: melhoria na inicialização de papéis disponíveis ao trocar de sites.

source: Multisite: Initialize a user’s roles correctly when setting them up for a different site.
pt_br: Multisite: inicializa corretamente as funções de um usuário ao configurá-las em um site diferente.

source: REST API: Support registering complex data structures for settings and meta
pt_br: API REST: suporte ao registro de estrutura de dados complexos para configurações e metadados.

source: REST API: Support for objects in schema validation and sanitization.
pt_br: API REST: validação e higienização de objetos pelo esquema do WordPress.

source: Role/Capability: Introduce capabilities dedicated to installing and updating language files.
pt_br: Funções e capacidades: introdução de capacidades dedicadas à instalação e atualização de arquivos de idiomas.

source: Remove SWFUpload.
pt_br: Exclusão do SWFUpload.

source: Users: Require a confirmation link in an email to be clicked when a user attempts to change their email address.
pt_br: Usuários: acesso obrigatório de um link enviado por e-mail quando um usuário tenta alterar este campo.

source: Core and the unit test suite is fully compatible with the upcoming release of PHP 7.2
pt_br: Arquivos básicos e testes de unidade estão completamente compatíveis com a versão 7.2 do PHP.

source: If you want a more in-depth view of what major changes have made it into 4.9, check out posts tagged with 4.9 on the main development blog, or look at a list of everything that’s changed.
pt_br: Se você quer uma visão mais detalhada das maiores mudanças feitas para a versão 4.9, dê uma olhada nos posts com a tag 4.9 no blog de desenvolvimento, ou leia a lista completa do que mudou.

source: There will be more developer notes to come, so keep an eye out for those as well.
pt_br: Novas observações dos desenvolvedores virão por aí, então é bom ficar de olho.

source: If you think you’ve found a bug, you can post to the Alpha/Beta area in the support forums.
pt_br: Se acha que encontrou um erro, você pode publicá-lo na área Alpha/Beta nos fóruns de suporte (em inglês).

source: We’d love to hear from you!
pt_br: Nós vamos adorar ouvir você!

source: If you’re comfortable writing a reproducible bug report, file one on WordPress Trac, where you can also find a list of known bugs.
pt_br: Se você se sente confortável para escrever um relatório de como reproduzir o erro, envie para o Trac do WordPress, onde também é possível encontrar uma lista de erros conhecidos.

source: Happy testing!
pt_br: Bons testes!

source: Without your testing, we might hurt the internet.
pt_br: Vamos todos testar, Para a internet não quebrar, É só não deixar nenhum erro passar.
